// 所有役满合集(不含古役和累计役满)
// 所用报菜名的角色是一姬, 因为实在是太多我就不做其他角色的了, 想换的话可以直接查字典
// 下面分析不一定全, 可能有漏想的

/**
 * 单倍役满
 *      天和
 *      地和
 *      大三元
 *      四暗刻
 *      字一色
 *      绿一色
 *      清老头
 *      国士无双
 *      小四喜
 *      四杠子
 *      九莲宝灯
 * 小计: 11
 *
 * 双倍役满_非复合
 *      纯正九莲宝灯
 *      四暗刻单骑
 *      国士无双十三面
 *      大四喜
 * 小计: 4
 *
 * 双倍役满_复合
 *      天和      大三元
 *      天和      字一色 (大七星)
 *      天和      绿一色
 *      天和      小四喜
 *
 *      地和      大三元
 *      地和      四暗刻
 *      地和      字一色
 *      地和      绿一色
 *      地和      国士无双
 *      地和      小四喜
 *      地和      九莲宝灯
 *
 *      大三元     四暗刻
 *      大三元     字一色
 *      大三元     四杠子 (副露)
 *
 *      四暗刻     字一色
 *      四暗刻     绿一色
 *      四暗刻     清老头
 *      四暗刻     小四喜
 *
 *      字一色     小四喜
 *      字一色     四杠子 (副露)
 *
 *      绿一色     四杠子 (副露)
 *
 *      清老头     四杠子 (副露)
 *
 *      小四喜     四杠子 (副露)
 * 小计: 23
 * 两倍役满数: 27
 *
 * 三倍役满_2+1
 *      天和      纯正九莲宝灯
 *      天和      四暗刻单骑
 *      天和      国士无双十三面
 *
 *      地和      纯正九莲宝灯
 *      地和      四暗刻单骑
 *      地和      国士无双十三面
 *
 *      大三元     四暗刻单骑
 *
 *      字一色     四暗刻单骑
 *      字一色     大四喜
 *
 *      绿一色     四暗刻单骑
 *
 *      清老头     四暗刻单骑
 *
 *      小四喜     四暗刻单骑
 *
 *      四杠子     四暗刻单骑
 * 小计: 13
 *
 * 三倍役满_1+1+1
 *      地和      大三元     四暗刻
 *      地和      四暗刻     字一色
 *      地和      四暗刻     绿一色
 *      地和      四暗刻     清老头
 *      地和      四暗刻     小四喜
 *
 *      大三元     四暗刻     字一色
 *      大三元     字一色     四杠子 (副露)
 *
 *      四暗刻     字一色     小四喜
 *
 *      字一色     小四喜     四杠子 (副露)
 * 小计: 9
 * 三倍役满数: 22
 *
 * 四倍役满_2+2
 *      四暗刻单骑       大四喜
 * 小计: 1
 *
 * 四倍役满_2+1+1
 *      天和      大三元     四暗刻单骑
 *      天和      字一色     四暗刻单骑
 *      天和      绿一色     四暗刻单骑
 *      天和      清老头     四暗刻单骑
 *      天和      小四喜     四暗刻单骑
 *
 *      地和      大三元     四暗刻单骑
 *      地和      字一色     四暗刻单骑
 *      地和      绿一色     四暗刻单骑
 *      地和      清老头     四暗刻单骑
 *      地和      小四喜     四暗刻单骑
 *
 *      大三元     字一色     四暗刻单骑
 *      大三元     四杠子     四暗刻单骑
 *
 *      四暗刻     字一色     大四喜
 *
 *      字一色     小四喜     四暗刻单骑
 *      字一色     四杠子     四暗刻单骑
 *
 *      绿一色     四杠子     四暗刻单骑
 *
 *      清老头     四杠子     四暗刻单骑
 *
 *      小四喜     四杠子     四暗刻单骑
 * 小计: 18
 *
 * 四倍役满_1+1+1+1
 *      地和      大三元     四暗刻     字一色
 *      地和      四暗刻     字一色     小四喜
 * 小计: 2
 * 四倍役满数: 21
 *
 * 五倍役满_2+2+1
 *      天和      四暗刻单骑       大四喜
 *      地和      四暗刻单骑       大四喜
 *      字一色     四暗刻单骑       大四喜
 *      四杠子     四暗刻单骑       大四喜
 * 小计: 4
 *
 * 五倍役满_2+1+1+1
 *      天和      大三元     字一色     四暗刻单骑
 *      天和      字一色     小四喜     四暗刻单骑
 *
 *      地和      大三元     字一色     四暗刻单骑
 *      地和      四暗刻     字一色     大四喜
 *      地和      字一色     小四喜     四暗刻单骑
 *
 *      大三元     字一色     四杠子     四暗刻单骑
 *
 *      字一色     小四喜     四杠子     四暗刻单骑
 * 小计: 7
 * 五倍役满数: 11
 *
 * 六倍役满_2+2+1+1
 *      天和      字一色     四暗刻单骑       大四喜
 *
 *      地和      字一色     四暗刻单骑       大四喜
 *
 *      字一色     四杠子     四暗刻单骑       大四喜
 * 六倍役满数: 3
 */


