"""
    这个文件使用"template.js"来对所有报菜名进行同步刷新
"""
import re

nicknames = [
    ["一姬-契约", "新年初诣", "一姬当千", "绮春歌"],
    ["二阶堂美树-契约", "化妆舞会", "万象沐春", "鸢尾花之夜"],
    ["藤田佳奈-契约", "圣诞嘉年华", "暗夜法则", "假日之滨"],
    ["三上千织-契约", "清凉夏日", "甜蜜茶点", "天黑请闭眼"],
    ["相原舞-契约", "昭华年", "禁锢之地", "温存韶光"],
    ["抚子-契约", "细雪呈瑞", "四方雀者", "无拘乐趣"],
    ["八木唯-契约", "月夜华尔兹", "悸动之夏", "四方雀者"],
    ["九条璃雨-契约", "瑞雪迎新", "魂色幻想", "心跳时速"],
    ["泽尼娅-契约", "化妆舞会", "清凉夏日", "绮春歌"],
    ["卡维-契约", "卡维", "命运之夏", "拂晓的G大调"],
    ["轻库娘-契约", "轻库娘", "轻库娘-契约", "清凉夏日"],
    ["二之宫花-契约", "万象沐春", "命运之夏", "馥郁满室"],
    ["白石奈奈-契约", "白石奈奈", "清凉夏日", "馥郁满室"],
    ["小鸟游雏田-契约", "花火之约", "魂色幻想", "无拘乐趣"],
    ["五十岚阳菜-契约", "春日返校季", "新岁添喜", "无拘乐趣"],
    ["凉宫杏树-契约", "睡前故事", "花火之约", "贺今朝"],
    ["北见纱和子-契约", "月夜华尔兹", "枕边私语", "心跳时速"],
    ["雏桃-契约", "雏桃", "昭华年", "醇香初夏"],
    ["辉夜姬-契约", "雪夜絮语", "择芳意", "氤氲浮光"],
    ["艾丽莎-契约", "择芳意", "天黑请闭眼", "心跳时速"],
    ["寺崎千穗理-契约", "寺崎千穗理", "寺崎千穗理-契约", "佳期不负"],
    ["宫永咲-契约", "宫永咲", "凛然花开", "兔耳派对"],
    ["原村和-契约", "原村和", "凛然花开", "兔耳派对"],
    ["天江衣-契约", "天江衣", "凛然花开", "兔耳派对"],
    ["宫永照-契约", "宫永照", "凛然花开", "兔耳派对"],
    ["福姬-契约", "春池小憩", "甜蜜魔法", "假日之滨"],
    ["七海礼奈-契约", "七海礼奈", "白色礼赞", "枕边私语"],
    ["姬川响-契约", "姬川响", "新岁添喜", "奇遇星光"],
    ["森川绫子-契约", "森川绫子", "满分假期", "拂晓的G大调"],
    ["西园寺一羽-契约", "西园寺一羽", "西园寺一羽-契约", "西园寺一羽"],
    ["小野寺七羽-契约", "小野寺七羽", "小野寺七羽-契约", "夏日风物诗"],
    ["四宫辉夜-契约", "四宫辉夜", "四宫辉夜-契约", "偷心怪盗"],
    ["早坂爱-契约", "早坂爱", "早坂爱-契约", "偷心怪盗"],
    ["白银圭-契约", "白银圭", "白银圭-契约", "偷心怪盗"],
    ["柚-契约", "柚", "枕边私语", "新岁景明"],
    ["北原莉莉-契约", "北原莉莉", "北原莉莉-契约", "北原莉莉"],
    ["竹井久-契约", "竹井久", "竹井久-契约", "兔耳派对"],
    ["福路美穗子-契约", "福路美穗子", "福路美穗子-契约", "兔耳派对"],
    ["新子憧-契约", "新子憧", "新子憧-契约", "兔耳派对"],
    ["园城寺怜-契约", "园城寺怜", "园城寺怜-契约", "兔耳派对"],
    ["四宫冬实-契约", "馥郁满室", "暖冬邂逅", "奇遇星光"],
    ["青鸾-契约", "青鸾", "青鸾-契约", "贺今朝"],
    ["如月彩音-契约", "如月彩音", "如月彩音-契约", "暖冬邂逅"],
    ["未来-契约", "未来", "未来-契约", "迷人礼颂"],
    ["C.C.-契约", "C.C.", "C.C.-契约", "棋盘晚宴"],
    ["红月卡莲-契约", "红月卡莲", "红月卡莲-契约", "棋盘晚宴"],
    ["岚星-契约", "岚星", "岚星-契约", "岚星"],
    ["东城玄音-契约", "东城玄音", "东城玄音-契约", "东城玄音"],
    ["伊莉雅-契约", "伊莉雅", "伊莉雅-契约", "Prism Live"],
    ["美游-契约", "美游", "美游-契约", "Prism Live"],
    ["伊芙-契约", "伊芙", "伊芙-契约", "伊芙"],
    ["琳琅-契约", "琳琅", "琳琅-契约", "奇遇星光"],
    ["砂狼白子-契约", "砂狼白子", "砂狼白子-契约", "华芳雅韵"],
    ["小鸟游星野-契约", "小鸟游星野", "小鸟游星野-契约", "华芳雅韵"],
    ["陆八魔爱露-契约", "陆八魔爱露", "陆八魔爱露-契约", "华芳雅韵"],
    ["浅黄睦月-契约", "浅黄睦月", "浅黄睦月-契约", "华芳雅韵"],
    ["莱娅-契约", "莱娅", "莱娅-契约", "莱娅"],
    ["辛西娅-契约", "辛西娅", "辛西娅-契约", "辛西娅"],
]
avatar_ids = [
    [400102, 400104, 400105, 400106],  # 一姬
    [400202, 400203, 400206, 400207],  # 二阶堂美树
    [400302, 400303, 400304, 400305],  # 藤田佳奈
    [400402, 400404, 400405, 400406],  # 三上千织
    [400502, 400504, 400505, 400506],  # 相原舞
    [400602, 400604, 400605, 400606],  # 抚子
    [400702, 400705, 400706, 400707],  # 八木唯
    [400802, 400804, 400805, 400806],  # 九条璃雨
    [400902, 400903, 400904, 400905],  # 泽尼娅
    [401002, 401001, 401003, 401004],  # 卡维
    [401502, 401501, 401502, 401503],  # 轻库娘
    [401702, 401706, 401707, 401708],  # 二之宫花
    [401802, 401801, 401803, 401804],  # 白石奈奈
    [401902, 401904, 401905, 401906],  # 小鸟游雏田
    [402002, 402004, 402005, 402006],  # 五十岚阳菜
    [402102, 402103, 402104, 402105],  # 凉宫杏树
    [402402, 402404, 402405, 402406],  # 北见纱和子
    [402602, 402601, 402603, 402604],  # 雏桃
    [402902, 402903, 402904, 402905],  # 辉夜姬
    [403202, 403204, 403205, 403206],  # 艾丽莎
    [403302, 403301, 403302, 403303],  # 寺崎千穗理
    [403402, 403401, 403403, 403404],  # 宫永咲
    [403502, 403501, 403503, 403504],  # 原村和
    [403602, 403601, 403603, 403604],  # 天江衣
    [403702, 403701, 403703, 403704],  # 宫永照
    [403802, 403803, 403804, 403805],  # 福姬
    [404402, 404401, 404403, 404404],  # 七海礼奈
    [404602, 404601, 404603, 404604],  # 姬川响
    [404802, 404801, 404803, 404804],  # 森川绫子
    [405202, 405201, 405202, 405201],  # 西园寺一羽
    [405302, 405301, 405302, 405303],  # 小野寺七羽
    [405502, 405501, 405502, 405503],  # 四宫辉夜
    [405702, 405701, 405702, 405703],  # 早坂爱
    [405802, 405801, 405802, 405803],  # 白银圭
    [405902, 405901, 405903, 405904],  # 柚
    [406102, 406101, 406102, 406101],  # 北原莉莉
    [406202, 406201, 406202, 406203],  # 竹井久
    [406302, 406301, 406302, 406303],  # 福路美穗子
    [406402, 406401, 406402, 406403],  # 新子憧
    [406502, 406501, 406502, 406503],  # 园城寺怜
    [406602, 406603, 406604, 406605],  # 四宫冬实
    [406702, 406701, 406702, 406703],  # 青鸾
    [406802, 406801, 406802, 406803],  # 如月彩音
    [406902, 406901, 406902, 406903],  # 未来
    [407102, 407101, 407102, 407103],  # C.C.
    [407302, 407301, 407302, 407303],  # 红月卡莲
    [407402, 407401, 407402, 407401],  # 岚星
    [407602, 407601, 407602, 407601],  # 东城玄音
    [407902, 407901, 407902, 407903],  # 伊莉雅
    [408002, 408001, 408002, 408003],  # 美游
    [408302, 408301, 408302, 408301],  # 伊芙
    [408402, 408401, 408402, 408403],  # 琳琅
    [408602, 408601, 408602, 408603],  # 砂狼白子
    [408702, 408701, 408702, 408703],  # 小鸟游星野
    [408802, 408801, 408802, 408803],  # 陆八魔爱露
    [408902, 408901, 408902, 408903],  # 浅黄睦月
    [409302, 409301, 409302, 409301],  # 莱娅
    [409402, 409401, 409402, 409401],  # 辛西娅
]
outfile_names = [
    "400101_一姬.js",
    "400201_二阶堂美树.js",
    "400301_藤田佳奈.js",
    "400401_三上千织.js",
    "400501_相原舞.js",
    "400601_抚子.js",
    "400701_八木唯.js",
    "400801_九条璃雨.js",
    "400901_泽尼娅.js",
    "401001_卡维.js",
    "401501_轻库娘.js",
    "401701_二之宫花.js",
    "401801_白石奈奈.js",
    "401901_小鸟游雏田.js",
    "402001_五十岚阳菜.js",
    "402101_凉宫杏树.js",
    "402401_北见纱和子.js",
    "402601_雏桃.js",
    "402901_辉夜姬.js",
    "403201_艾丽莎.js",
    "403301_寺崎千穗理.js",
    "403401_宫永咲.js",
    "403501_原村和.js",
    "403601_天江衣.js",
    "403701_宫永照.js",
    "403801_福姬.js",
    "404401_七海礼奈.js",
    "404601_姬川响.js",
    "404801_森川绫子.js",
    "405201_西园寺一羽.js",
    "405301_小野寺七羽.js",
    "405501_四宫辉夜.js",
    "405701_早坂爱.js",
    "405801_白银圭.js",
    "405901_柚.js",
    "406101_北原莉莉.js",
    "406201_竹井久.js",
    "406301_福路美穗子.js",
    "406401_新子憧.js",
    "406501_园城寺怜.js",
    "406601_四宫冬实.js",
    "406701_青鸾.js",
    "406801_如月彩音.js",
    "406901_未来.js",
    "407101_C.C..js",
    "407301_红月卡莲.js",
    "407401_岚星.js",
    "407601_东城玄音.js",
    "407901_伊莉雅.js",
    "408001_美游.js",
    "408301_伊芙.js",
    "408401_琳琅.js",
    "408601_砂狼白子.js",
    "408701_小鸟游星野.js",
    "408801_陆八魔爱露.js",
    "408901_浅黄睦月.js",
    "409301_莱娅.js",
    "409401_辛西娅.js",
]

infile_name = "template.js"
infile = open("./" + infile_name, "r")

pattern_name = r"editdata\.player_datas\[\d]\.nickname = \"(.*)\";"
pattern_id = r"editdata\.player_datas\[\d]\.avatar_id = (.*);"

for i in range(len(avatar_ids)):
    outfile = open("./output/" + outfile_names[i], "w")
    name_count = 0
    id_count = 0

    for line in infile:
        result = re.search(pattern_name, line)
        if name_count < 3 and result:
            # 匹配成功, result[0] 是全体, result[1] 是 nickname
            if name_count == 0:
                line = line.replace(result[1], nicknames[i][name_count])
            else:
                line = line.replace(result[1], nicknames[i][name_count + 1])
            name_count += 1
        if id_count < 3 and name_count == 3:
            result = re.search(pattern_id, line)
            if result:
                # 匹配成功, result[0] 是全体, result[1] 是 avatar_id
                if name_count == 0:
                    line = line.replace(result[1], str(avatar_ids[i][id_count]))
                else:
                    line = line.replace(result[1], str(avatar_ids[i][id_count + 1]))
                id_count += 1
        outfile.write(line)
    infile.seek(0)
    outfile.close()

infile.close()
