nicknames = [
    ["一姬", "一姬-契约", "海滩派对", "新年初诣", "一姬当千", "绮春歌"],
    ["二阶堂美树", "二阶堂美树-契约", "化妆舞会", "万象沐春", "鸢尾花之夜"],
    ["藤田佳奈", "藤田佳奈-契约", "圣诞嘉年华", "暗夜法则", "假日之滨"],
    ["三上千织", "三上千织-契约", "圣诞嘉年华", "清凉夏日", "甜蜜茶点", "天黑请闭眼"],
    ["相原舞", "相原舞-契约", "海滩派对", "昭华年", "禁锢之地", "温存韶光"],
    ["抚子", "抚子-契约", "海滩派对", "细雪呈瑞", "四方雀者", "无拘乐趣"],
    ["八木唯", "八木唯-契约", "圣诞嘉年华", "魇魔之约", "月夜华尔兹", "悸动之夏", "四方雀者"],
    ["九条璃雨", "九条璃雨-契约", "海滩派对", "瑞雪迎新", "魂色幻想", "心跳时速"],
    ["泽尼娅", "泽尼娅-契约", "化妆舞会", "清凉夏日", "绮春歌"],
    ["卡维", "卡维-契约", "命运之夏", "拂晓的G大调"],
    # ["四宫夏生", "四宫夏生-契约", "化妆舞会", "细雪呈瑞", "悸动之夏"],
    # ["汪次郎", "汪次郎-契约", "化妆舞会", "假日之滨"],
    # ["一之濑空", "一之濑空-契约", "圣诞嘉年华", "春日返校季", "绮春歌"],
    # ["明智英树", "明智英树-契约", "魇魔之约", "命运之夏", "佳期不负"],
    ["轻库娘", "轻库娘-契约", "清凉夏日"],
    # ["莎拉", "莎拉-契约", "新年初诣", "春日返校季", "悸动之夏", "四方雀者"],
    ["二之宫花", "二之宫花-契约", "万象沐春", "命运之夏", "馥郁满室"],
    ["白石奈奈", "白石奈奈-契约", "清凉夏日", "馥郁满室"],
    ["小鸟游雏田", "小鸟游雏田-契约", "甜蜜茶点", "花火之约", "魂色幻想", "无拘乐趣"],
    ["五十岚阳菜", "五十岚阳菜-契约", "清凉夏日", "春日返校季", "新岁添喜", "无拘乐趣"],
    ["凉宫杏树", "凉宫杏树-契约", "睡前故事", "花火之约", "贺今朝"],
    # ["约瑟夫", "约瑟夫-契约", "瑞雪迎新"],
    # ["斋藤治", "斋藤治-契约", "花火之约", "暖冬邂逅"],
    ["北见纱和子", "北见纱和子-契约", "雪夜絮语", "月夜华尔兹", "枕边私语", "心跳时速"],
    # ["艾因", "艾因-契约", "命运之夏", "天黑请闭眼"],
    ["雏桃", "雏桃-契约", "昭华年", "醇香初夏"],
    # ["月见山", "月见山-契约", "春日返校季", "禁锢之地", "温存韶光"],
    # ["藤本绮罗", "藤本绮罗-契约", "瑞雪迎新", "满分假期", "温存韶光"],
    ["辉夜姬", "辉夜姬-契约", "雪夜絮语", "择芳意", "氤氲浮光"],
    # ["如月莲", "如月莲-契约", "暗夜法则", "新岁景明"],
    # ["石原碓海", "石原碓海-契约", "白色礼赞", "假日之滨"],
    ["艾丽莎", "艾丽莎-契约", "睡前故事", "择芳意", "天黑请闭眼", "心跳时速"],
    ["寺崎千穗理", "寺崎千穗理-契约", "佳期不负"],
    ["宫永咲", "宫永咲-契约", "凛然花开", "兔耳派对"],
    ["原村和", "原村和-契约", "凛然花开", "兔耳派对"],
    ["天江衣", "天江衣-契约", "凛然花开", "兔耳派对"],
    ["宫永照", "宫永照-契约", "凛然花开", "兔耳派对"],
    ["福姬", "福姬-契约", "春池小憩", "甜蜜魔法", "假日之滨"],
    # ["七夕", "七夕-契约", "悸动之夏", "四方雀者"],
    # ["蛇喰梦子", "蛇喰梦子-契约", "百花缭乱"],
    # ["早乙女芽亚里", "早乙女芽亚里-契约", "百花缭乱"],
    # ["生志摩妄", "生志摩妄-契约", "百花缭乱"],
    # ["桃喰绮罗莉", "桃喰绮罗莉-契约", "百花缭乱"],
    ["七海礼奈", "七海礼奈-契约", "白色礼赞", "枕边私语"],
    # ["A-37", "A-37-契约", "花火之约", "醇香初夏"],
    ["姬川响", "姬川响-契约", "新岁添喜", "奇遇星光"],
    # ["莱恩", "莱恩-契约", "甜蜜魔法", "天黑请闭眼"],
    ["森川绫子", "森川绫子-契约", "满分假期", "拂晓的G大调"],
    # ["泷川夏彦", "泷川夏彦-契约", "氤氲浮光", "贺今朝"],
    # ["赤木茂", "赤木茂-契约", "光暗对决"],
    # ["鹫巢岩", "鹫巢岩-契约", "光暗对决"],
    ["西园寺一羽", "西园寺一羽-契约"],
    ["小野寺七羽", "小野寺七羽-契约", "夏日风物诗"],
    # ["夏弥尔", "夏弥尔-契约", "春池小憩", "迷人礼颂"],
    ["四宫辉夜", "四宫辉夜-契约", "偷心怪盗"],
    ["早坂爱", "早坂爱-契约", "偷心怪盗"],
    ["白银圭", "白银圭-契约", "偷心怪盗"],
    ["柚", "柚-契约", "枕边私语", "新岁景明"],
    # ["泽克斯", "泽克斯-契约", "夏日风物诗"],
    ["北原莉莉", "北原莉莉-契约"],
    ["竹井久", "竹井久-契约", "兔耳派对"],
    ["福路美穗子", "福路美穗子-契约", "兔耳派对"],
    ["新子憧", "新子憧-契约", "兔耳派对"],
    ["园城寺怜", "园城寺怜-契约", "兔耳派对"],
    ["四宫冬实", "四宫冬实-契约", "馥郁满室", "暖冬邂逅", "奇遇星光"],
    ["青鸾", "青鸾-契约", "贺今朝"],
    ["如月彩音", "如月彩音-契约", "暖冬邂逅"],
    ["未来", "未来-契约", "迷人礼颂"],
    # ["鲁鲁修·兰佩洛基", "鲁鲁修·兰佩洛基-契约", "棋盘晚宴"],
    ["C.C.", "C.C.-契约", "棋盘晚宴"],
    # ["枢木朱雀", "枢木朱雀-契约", "棋盘晚宴"],
    ["红月卡莲", "红月卡莲-契约", "棋盘晚宴"],
    ["岚星", "岚星-契约"],
    # ["凌", "凌-契约"],
    ["东城玄音", "东城玄音-契约"],
    # ["汉娜", "汉娜-契约", "迷人礼颂"],
    # ["穆萨", "穆萨-契约"],
    ["伊莉雅", "伊莉雅-契约", "Prism Live"],
    ["美游", "美游-契约", "Prism Live"],
    # ["小黑", "小黑-契约", "Prism Live"],
    # ["吉尔", "吉尔-契约", "Prism Live"],
    ["伊芙", "伊芙-契约"],
    ["琳琅", "琳琅-契约", "奇遇星光"],
    # ["袁枫", "袁枫-契约"],
    ["砂狼白子", "砂狼白子-契约", "华芳雅韵"],
    ["小鸟游星野", "小鸟游星野-契约", "华芳雅韵"],
    ["陆八魔爱露", "陆八魔爱露-契约", "华芳雅韵"],
    ["浅黄睦月", "浅黄睦月-契约", "华芳雅韵"],
    # ["玖辻", "玖辻-契约"],
    ["莱娅", "莱娅-契约"],
    ["辛西娅", "辛西娅-契约"],
]

avatar_ids = [
    [400101, 400102, 400103, 400104, 400105, 400106],  # 一姬
    [400201, 400202, 400203, 400206, 400207],  # 二阶堂美树
    [400301, 400302, 400303, 400304, 400305],  # 藤田佳奈
    [400401, 400402, 400403, 400404, 400405, 400406],  # 三上千织
    [400501, 400502, 400503, 400504, 400505, 400506],  # 相原舞
    [400601, 400602, 400603, 400604, 400605, 400606],  # 抚子
    [400701, 400702, 400703, 400704, 400705, 400706, 400707],  # 八木唯
    [400801, 400802, 400803, 400804, 400805, 400806],  # 九条璃雨
    [400901, 400902, 400903, 400904, 400905],  # 泽尼娅
    [401001, 401002, 401003, 401004],  # 卡维
    # [401101, 401102, 401103, 401104, 401105],  # 四宫夏生
    # [401201, 401202, 401203, 401204],  # 汪次郎
    # [401301, 401302, 401303, 401304, 401305],  # 一之濑空
    # [401401, 401402, 401403, 401404, 401405],  # 明智英树
    [401501, 401502, 401503],  # 轻库娘
    # [401601, 401602, 401603, 401604, 401605, 401606],  # 莎拉
    [401701, 401702, 401706, 401707, 401708],  # 二之宫花
    [401801, 401802, 401803, 401804],  # 白石奈奈
    [401901, 401902, 401903, 401904, 401905, 401906],  # 小鸟游雏田
    [402001, 402002, 402003, 402004, 402005, 402006],  # 五十岚阳菜
    [402101, 402102, 402103, 402104, 402105],  # 凉宫杏树
    # [402201, 402202, 402203],  # 约瑟夫
    # [402201, 402202, 402203],  # 斋藤治
    [402401, 402402, 402403, 402404, 402405, 402406],  # 北见纱和子
    # [402501, 402502, 402503, 402504],  # 艾因
    [402601, 402602, 402603, 402604],  # 雏桃
    # [402701, 402702, 402703, 402704, 402705],  # 月见山
    # [402801, 402802, 402803, 402804, 402805],  # 藤本绮罗
    [402901, 402902, 402903, 402904, 402905],  # 辉夜姬
    # [403001, 403002, 403003, 403004],  # 如月莲
    # [403101, 403102, 403103, 403104],  # 石原碓海
    [403201, 403202, 403203, 403204, 403205, 403206],  # 艾丽莎
    [403301, 403302, 403303],  # 寺崎千穗理
    [403401, 403402, 403403, 403404],  # 宫永咲
    [403501, 403502, 403503, 403504],  # 原村和
    [403601, 403602, 403603, 403604],  # 天江衣
    [403702, 403702, 403703, 403704],  # 宫永照
    [403801, 403802, 403803, 403804, 403805],  # 福姬
    # [403901, 403902, 403903, 403904],  # 七夕
    # [404001, 404002, 404003],  # 蛇喰梦子
    # [404101, 404102, 404103],  # 福姬
    # [404201, 404202, 404203],  # 生志摩妄
    # [404301, 404302, 404303],  # 桃喰绮罗莉
    [404401, 404402, 404403, 404404],  # 七海礼奈
    # [404501, 404502, 404503, 404504],  # A-37
    [404601, 404602, 404603, 404604],  # 姬川响
    # [404701, 404702, 404703, 404704],  # 莱恩
    [404801, 404802, 404803, 404804],  # 森川绫子
    # [404901, 404902, 404903, 404904],  # 泷川夏彦
    # [405001, 405002, 405003],  # 赤木茂
    # [405101, 405102, 405103],  # 鹫巢岩
    [405201, 405202],  # 西园寺一羽
    [405301, 405302, 405303],  # 小野寺七羽
    # [405401, 405402, 405403, 405404],  # 夏弥尔
    [405501, 405502, 405503],  # 四宫辉夜
    [405701, 405702, 405703],  # 早坂爱
    [405801, 405802, 405803],  # 白银圭
    [405901, 405902, 405903, 405904],  # 柚
    # [406001, 406002, 406003],  # 泽克斯
    [406101, 406102],  # 北原莉莉
    [406201, 406202, 406203],  # 竹井久
    [406301, 406302, 406303],  # 福路美穗子
    [406401, 406402, 406403],  # 新子憧
    [406501, 406502, 406503],  # 园城寺怜
    [406601, 406602, 406603, 406604, 406605],  # 四宫冬实
    [406701, 406702, 406703],  # 青鸾
    [406801, 406802, 406803],  # 如月彩音
    [406901, 406902, 406903],  # 未来
    # [407001, 407002, 407003],  # 鲁鲁修·兰佩洛基
    [407101, 407102, 407103],  # C.C.
    # [407201, 407202, 407203],  # 枢木朱雀
    [407301, 407302, 407303],  # 红月卡莲
    [407401, 407402],  # 岚星
    # [407501, 407502],  # 凌
    [407601, 407602],  # 东城玄音
    # [407701, 407702, 407703],  # 汉娜
    # [407801, 407802],  # 穆萨
    [407901, 407902, 407903],  # 伊莉雅
    [408001, 408002, 408003],  # 美游
    # [408101, 408102, 408103],  # 小黑
    # [408201, 408202, 408203],  # 吉尔
    [408301, 408302],  # 伊芙
    [408401, 408402, 408403],  # 琳琅
    # [408501, 408502],  # 袁枫
    [408601, 408602, 408603],  # 砂狼白子
    [408701, 408702, 408703],  # 小鸟游星野
    [408801, 408802, 408803],  # 陆八魔爱露
    [408901, 408902, 408903],  # 浅黄睦月
    # [409001, 409002],  # 玖辻
    [409301, 409302],  # 莱娅
    [409401, 409402],  # 辛西娅
]

char_ids = [
    200001,  # 一姬
    200002,  # 二阶堂美树
    200003,  # 藤田佳奈
    200004,  # 三上千织
    200005,  # 相原舞
    200006,  # 抚子
    200007,  # 八木唯
    200008,  # 九条璃雨
    200009,  # 泽尼娅
    200010,  # 卡维
    # 200011,  # 四宫夏生
    # 200012,  # 汪次郎
    # 200013,  # 一之濑空
    # 200014,  # 明智英树
    200015,  # 轻库娘
    # 200016,  # 莎拉
    200017,  # 二之宫花
    200018,  # 白石奈奈
    200019,  # 小鸟游雏田
    200020,  # 五十岚阳菜
    200021,  # 凉宫杏树
    # 200022,  # 约瑟夫
    # 200023,  # 斋藤治
    200024,  # 北见纱和子
    # 200025,  # 艾因
    200026,  # 雏桃
    # 200027,  # 月见山
    # 200028,  # 藤本绮罗
    200029,  # 辉夜姬
    # 200030,  # 如月莲
    # 200031,  # 石原碓海
    200032,  # 艾丽莎
    200033,  # 寺崎千穗理
    200034,  # 宫永咲
    200035,  # 原村和
    200036,  # 天江衣
    200037,  # 宫永照
    200038,  # 福姬
    # 200039,  # 七夕
    # 200040,  # 蛇喰梦子
    # 200041,  # 早乙女芽亚里
    # 200042,  # 生志摩妄
    # 200043,  # 桃喰绮罗莉
    200044,  # 七海礼奈
    # 200045,  # A-37
    200046,  # 姬川响
    # 200047,  # 莱恩
    200048,  # 森川绫子
    # 200049,  # 泷川夏彦
    # 200050,  # 赤木茂
    # 200051,  # 鹫巢岩
    200052,  # 西园寺一羽
    200053,  # 小野寺七羽
    # 200054,  # 夏弥尔
    200055,  # 四宫辉夜
    200056,  # 白银御行
    200057,  # 早坂爱
    200058,  # 白银圭
    200059,  # 柚
    # 200060,  # 泽克斯
    200061,  # 北原莉莉
    200062,  # 竹井久
    200063,  # 福路美穗子
    200064,  # 新子憧
    200065,  # 园城寺怜
    200066,  # 四宫冬实
    200067,  # 青鸾
    200068,  # 如月彩音
    200069,  # 未来
    # 200070,  # 鲁鲁修·兰佩洛基
    200071,  # C.C.
    # 200072,  # 枢木朱雀
    200073,  # 红月卡莲
    200074,  # 岚星
    # 200075,  # 凌
    200076,  # 东城玄音
    # 200077,  # 汉娜
    # 200078,  # 穆萨
    200079,  # 伊莉雅
    200080,  # 美游
    # 200081,  # 小黑
    # 200082,  # 吉尔
    200083,  # 伊芙·克里斯特
    200084,  # 琳琅
    # 200085,  # 袁枫
    200086,  # 砂狼白子
    200087,  # 小鸟游星野
    200088,  # 陆八魔爱露
    200089,  # 浅黄睦月
    # 200090,  # 玖辻
    200093,  # 莱娅
    200094,  # 辛西娅
]

outfile_names = []
for i in range(len(avatar_ids)):
    outfile_names.append(str(char_ids[i]) + "_" + nicknames[i][0] + ".js")

pattern_name = r"editdata\.player_datas\[\d]\.nickname = \"(.*)\";"
pattern_id = r"editdata\.player_datas\[\d]\.avatar_id = (.*);"

infile = open("./template.js", "r")


