# 玩家昵称(与下面 avatar_ids 一一对应)
nicknames = [
    ["一姬", "一姬-契约", "海滩派对", "新年初诣", "一姬当千", "绮春歌"],
    ["二阶堂美树", "二阶堂美树-契约", "化妆舞会", "万象沐春", "鸢尾花之夜", "玩转夏日"],
    ["藤田佳奈", "藤田佳奈-契约", "圣诞嘉年华", "暗夜法则", "假日之滨"],
    ["三上千织", "三上千织-契约", "圣诞嘉年华", "清凉夏日", "甜蜜茶点", "天黑请闭眼"],
    ["相原舞", "相原舞-契约", "海滩派对", "昭华年", "禁锢之地", "温存韶光"],
    ["抚子", "抚子-契约", "海滩派对", "细雪呈瑞", "四方雀者", "无拘乐趣"],
    ["八木唯", "八木唯-契约", "圣诞嘉年华", "魇魔之约", "月夜华尔兹", "悸动之夏", "四方雀者"],
    ["九条璃雨", "九条璃雨-契约", "海滩派对", "瑞雪迎新", "魂色幻想", "心跳时速"],
    ["泽尼娅", "泽尼娅-契约", "化妆舞会", "清凉夏日", "绮春歌"],
    ["卡维", "卡维-契约", "命运之夏", "拂晓的G大调"],
    ["四宫夏生", "四宫夏生-契约", "化妆舞会", "细雪呈瑞", "悸动之夏"],
    ["汪次郎", "汪次郎-契约", "化妆舞会", "假日之滨"],
    ["一之濑空", "一之濑空-契约", "圣诞嘉年华", "春日返校季", "绮春歌"],
    ["明智英树", "明智英树-契约", "魇魔之约", "命运之夏", "佳期不负"],
    ["轻库娘", "轻库娘-契约", "清凉夏日"],
    ["莎拉", "莎拉-契约", "新年初诣", "春日返校季", "悸动之夏", "四方雀者"],
    ["二之宫花", "二之宫花-契约", "万象沐春", "命运之夏", "馥郁满室"],
    ["白石奈奈", "白石奈奈-契约", "清凉夏日", "馥郁满室"],
    ["小鸟游雏田", "小鸟游雏田-契约", "甜蜜茶点", "花火之约", "魂色幻想", "无拘乐趣"],
    ["五十岚阳菜", "五十岚阳菜-契约", "清凉夏日", "春日返校季", "新岁添喜", "无拘乐趣"],
    ["凉宫杏树", "凉宫杏树-契约", "睡前故事", "花火之约", "贺今朝"],
    ["约瑟夫", "约瑟夫-契约", "瑞雪迎新"],
    ["斋藤治", "斋藤治-契约", "花火之约", "暖冬邂逅"],
    ["北见纱和子", "北见纱和子-契约", "雪夜絮语", "月夜华尔兹", "枕边私语", "心跳时速"],
    ["艾因", "艾因-契约", "命运之夏", "天黑请闭眼"],
    ["雏桃", "雏桃-契约", "昭华年", "醇香初夏"],
    ["月见山", "月见山-契约", "春日返校季", "禁锢之地", "温存韶光"],
    ["藤本绮罗", "藤本绮罗-契约", "瑞雪迎新", "满分假期", "温存韶光"],
    ["辉夜姬", "辉夜姬-契约", "雪夜絮语", "择芳意", "氤氲浮光"],
    ["如月莲", "如月莲-契约", "暗夜法则", "新岁景明"],
    ["石原碓海", "石原碓海-契约", "白色礼赞", "假日之滨"],
    ["艾丽莎", "艾丽莎-契约", "睡前故事", "择芳意", "天黑请闭眼", "心跳时速"],
    ["寺崎千穗理", "寺崎千穗理-契约", "佳期不负", "玩转夏日"],
    ["宫永咲", "宫永咲-契约", "凛然花开", "兔耳派对"],
    ["原村和", "原村和-契约", "凛然花开", "兔耳派对"],
    ["天江衣", "天江衣-契约", "凛然花开", "兔耳派对"],
    ["宫永照", "宫永照-契约", "凛然花开", "兔耳派对"],
    ["福姬", "福姬-契约", "春池小憩", "甜蜜魔法", "假日之滨"],
    ["七夕", "七夕-契约", "悸动之夏", "四方雀者"],
    ["蛇喰梦子", "蛇喰梦子-契约", "百花缭乱"],
    ["早乙女芽亚里", "早乙女-契约", "百花缭乱"],
    ["生志摩妄", "生志摩妄-契约", "百花缭乱"],
    ["桃喰绮罗莉", "桃喰绮罗莉-契约", "百花缭乱"],
    ["七海礼奈", "七海礼奈-契约", "白色礼赞", "枕边私语"],
    ["A-37", "A-37-契约", "花火之约", "醇香初夏"],
    ["姬川响", "姬川响-契约", "新岁添喜", "奇遇星光"],
    ["莱恩", "莱恩-契约", "甜蜜魔法", "天黑请闭眼"],
    ["森川绫子", "森川绫子-契约", "满分假期", "拂晓的G大调"],
    ["泷川夏彦", "泷川夏彦-契约", "氤氲浮光", "贺今朝"],
    ["赤木茂", "赤木茂-契约", "光暗对决"],
    ["鹫巢岩", "鹫巢岩-契约", "光暗对决"],
    ["西园寺一羽", "西园寺一羽-契约"],
    ["小野寺七羽", "小野寺七羽-契约", "夏日风物诗"],
    ["夏弥尔", "夏弥尔-契约", "春池小憩", "迷人礼颂"],
    ["四宫辉夜", "四宫辉夜-契约", "偷心怪盗"],
    ["白银御行", "白银御行-契约", "偷心怪盗"],
    ["早坂爱", "早坂爱-契约", "偷心怪盗"],
    ["白银圭", "白银圭-契约", "偷心怪盗"],
    ["柚", "柚-契约", "枕边私语", "新岁景明", "玩转夏日"],
    ["泽克斯", "泽克斯-契约", "夏日风物诗"],
    ["北原莉莉", "北原莉莉-契约"],
    ["竹井久", "竹井久-契约", "兔耳派对"],
    ["福路美穗子", "福路美穗子-契约", "兔耳派对"],
    ["新子憧", "新子憧-契约", "兔耳派对"],
    ["园城寺怜", "园城寺怜-契约", "兔耳派对"],
    ["四宫冬实", "四宫冬实-契约", "馥郁满室", "暖冬邂逅", "奇遇星光"],
    ["青鸾", "青鸾-契约", "贺今朝"],
    ["如月彩音", "如月彩音-契约", "暖冬邂逅"],
    ["未来", "未来-契约", "迷人礼颂"],
    ["鲁鲁修·兰佩洛基", "鲁鲁修-契约", "棋盘晚宴"],
    ["C.C.", "C.C.-契约", "棋盘晚宴"],
    ["枢木朱雀", "枢木朱雀-契约", "棋盘晚宴"],
    ["红月卡莲", "红月卡莲-契约", "棋盘晚宴"],
    ["岚星", "岚星-契约"],
    ["凌", "凌-契约", "玩转夏日"],
    ["东城玄音", "东城玄音-契约"],
    ["汉娜", "汉娜-契约", "迷人礼颂"],
    ["穆萨", "穆萨-契约"],
    ["伊莉雅", "伊莉雅-契约", "Prism Live"],
    ["美游", "美游-契约", "Prism Live"],
    ["小黑", "小黑-契约", "Prism Live"],
    ["吉尔", "吉尔-契约", "Prism Live"],
    ["伊芙", "伊芙-契约"],
    ["琳琅", "琳琅-契约", "奇遇星光"],
    ["袁枫", "袁枫-契约"],
    ["砂狼白子", "砂狼白子-契约", "华芳雅韵"],
    ["小鸟游星野", "小鸟游星野-契约", "华芳雅韵"],
    ["陆八魔爱露", "陆八魔爱露-契约", "华芳雅韵"],
    ["浅黄睦月", "浅黄睦月-契约", "华芳雅韵"],
    ["玖辻", "玖辻-契约"],
    ["莱娅", "莱娅-契约"],
    ["辛西娅", "辛西娅-契约"],
    ["南枫花", "南枫花-契约"],
]

# 玩家所用头像(与上面 nicknames 一一对应)
avatar_ids = [
    [400101, 400102, 400103, 400104, 400105, 400106],  # 一姬
    [400201, 400202, 400203, 400206, 400207, 400208],  # 二阶堂美树
    [400301, 400302, 400303, 400304, 400305],  # 藤田佳奈
    [400401, 400402, 400403, 400404, 400405, 400406],  # 三上千织
    [400501, 400502, 400503, 400504, 400505, 400506],  # 相原舞
    [400601, 400602, 400603, 400604, 400605, 400606],  # 抚子
    [400701, 400702, 400703, 400704, 400705, 400706, 400707],  # 八木唯
    [400801, 400802, 400803, 400804, 400805, 400806],  # 九条璃雨
    [400901, 400902, 400903, 400904, 400905],  # 泽尼娅
    [401001, 401002, 401003, 401004],  # 卡维
    [401101, 401102, 401103, 401104, 401105],  # 四宫夏生
    [401201, 401202, 401203, 401204],  # 汪次郎
    [401301, 401302, 401303, 401304, 401305],  # 一之濑空
    [401401, 401402, 401403, 401404, 401405],  # 明智英树
    [401501, 401502, 401503],  # 轻库娘
    [401601, 401602, 401603, 401604, 401605, 401606],  # 莎拉
    [401701, 401702, 401706, 401707, 401708],  # 二之宫花
    [401801, 401802, 401803, 401804],  # 白石奈奈
    [401901, 401902, 401903, 401904, 401905, 401906],  # 小鸟游雏田
    [402001, 402002, 402003, 402004, 402005, 402006],  # 五十岚阳菜
    [402101, 402102, 402103, 402104, 402105],  # 凉宫杏树
    [402201, 402202, 402203],  # 约瑟夫
    [402301, 402302, 402303, 402304],  # 斋藤治
    [402401, 402402, 402403, 402404, 402405, 402406],  # 北见纱和子
    [402501, 402502, 402503, 402504],  # 艾因
    [402601, 402602, 402603, 402604],  # 雏桃
    [402701, 402702, 402703, 402704, 402705],  # 月见山
    [402801, 402802, 402803, 402804, 402805],  # 藤本绮罗
    [402901, 402902, 402903, 402904, 402905],  # 辉夜姬
    [403001, 403002, 403003, 403004],  # 如月莲
    [403101, 403102, 403103, 403104],  # 石原碓海
    [403201, 403202, 403203, 403204, 403205, 403206],  # 艾丽莎
    [403301, 403302, 403303, 403304],  # 寺崎千穗理
    [403401, 403402, 403403, 403404],  # 宫永咲
    [403501, 403502, 403503, 403504],  # 原村和
    [403601, 403602, 403603, 403604],  # 天江衣
    [403702, 403702, 403703, 403704],  # 宫永照
    [403801, 403802, 403803, 403804, 403805],  # 福姬
    [403901, 403902, 403903, 403904],  # 七夕
    [404001, 404002, 404003],  # 蛇喰梦子
    [404101, 404102, 404103],  # 福姬
    [404201, 404202, 404203],  # 生志摩妄
    [404301, 404302, 404303],  # 桃喰绮罗莉
    [404401, 404402, 404403, 404404],  # 七海礼奈
    [404501, 404502, 404503, 404504],  # A-37
    [404601, 404602, 404603, 404604],  # 姬川响
    [404701, 404702, 404703, 404704],  # 莱恩
    [404801, 404802, 404803, 404804],  # 森川绫子
    [404901, 404902, 404903, 404904],  # 泷川夏彦
    [405001, 405002, 405003],  # 赤木茂
    [405101, 405102, 405103],  # 鹫巢岩
    [405201, 405202],  # 西园寺一羽
    [405301, 405302, 405303],  # 小野寺七羽
    [405401, 405402, 405403, 405404],  # 夏弥尔
    [405501, 405502, 405503],  # 四宫辉夜
    [405601, 405602, 405603],  # 白银御行
    [405701, 405702, 405703],  # 早坂爱
    [405801, 405802, 405803],  # 白银圭
    [405901, 405902, 405903, 405904, 405905],  # 柚
    [406001, 406002, 406003],  # 泽克斯
    [406101, 406102],  # 北原莉莉
    [406201, 406202, 406203],  # 竹井久
    [406301, 406302, 406303],  # 福路美穗子
    [406401, 406402, 406403],  # 新子憧
    [406501, 406502, 406503],  # 园城寺怜
    [406601, 406602, 406603, 406604, 406605],  # 四宫冬实
    [406701, 406702, 406703],  # 青鸾
    [406801, 406802, 406803],  # 如月彩音
    [406901, 406902, 406903],  # 未来
    [407001, 407002, 407003],  # 鲁鲁修·兰佩洛基
    [407101, 407102, 407103],  # C.C.
    [407201, 407202, 407203],  # 枢木朱雀
    [407301, 407302, 407303],  # 红月卡莲
    [407401, 407402],  # 岚星
    [407501, 407502, 407503],  # 凌
    [407601, 407602],  # 东城玄音
    [407701, 407702, 407703],  # 汉娜
    [407801, 407802],  # 穆萨
    [407901, 407902, 407903],  # 伊莉雅
    [408001, 408002, 408003],  # 美游
    [408101, 408102, 408103],  # 小黑
    [408201, 408202, 408203],  # 吉尔
    [408301, 408302],  # 伊芙
    [408401, 408402, 408403],  # 琳琅
    [408501, 408502],  # 袁枫
    [408601, 408602, 408603],  # 砂狼白子
    [408701, 408702, 408703],  # 小鸟游星野
    [408801, 408802, 408803],  # 陆八魔爱露
    [408901, 408902, 408903],  # 浅黄睦月
    [409001, 409002],  # 玖辻
    [409301, 409302],  # 莱娅
    [409401, 409402],  # 辛西娅
    [409501, 409502],  # 南枫花
]

# 所有角色的 id
charids = [
    200001,  # 一姬
    200002,  # 二阶堂美树
    200003,  # 藤田佳奈
    200004,  # 三上千织
    200005,  # 相原舞
    200006,  # 抚子
    200007,  # 八木唯
    200008,  # 九条璃雨
    200009,  # 泽尼娅
    200010,  # 卡维
    200011,  # 四宫夏生
    200012,  # 汪次郎
    200013,  # 一之濑空
    200014,  # 明智英树
    200015,  # 轻库娘
    200016,  # 莎拉
    200017,  # 二之宫花
    200018,  # 白石奈奈
    200019,  # 小鸟游雏田
    200020,  # 五十岚阳菜
    200021,  # 凉宫杏树
    200022,  # 约瑟夫
    200023,  # 斋藤治
    200024,  # 北见纱和子
    200025,  # 艾因
    200026,  # 雏桃
    200027,  # 月见山
    200028,  # 藤本绮罗
    200029,  # 辉夜姬
    200030,  # 如月莲
    200031,  # 石原碓海
    200032,  # 艾丽莎
    200033,  # 寺崎千穗理
    200034,  # 宫永咲
    200035,  # 原村和
    200036,  # 天江衣
    200037,  # 宫永照
    200038,  # 福姬
    200039,  # 七夕
    200040,  # 蛇喰梦子
    200041,  # 早乙女芽亚里
    200042,  # 生志摩妄
    200043,  # 桃喰绮罗莉
    200044,  # 七海礼奈
    200045,  # A-37
    200046,  # 姬川响
    200047,  # 莱恩
    200048,  # 森川绫子
    200049,  # 泷川夏彦
    200050,  # 赤木茂
    200051,  # 鹫巢岩
    200052,  # 西园寺一羽
    200053,  # 小野寺七羽
    200054,  # 夏弥尔
    200055,  # 四宫辉夜
    200056,  # 白银御行
    200057,  # 早坂爱
    200058,  # 白银圭
    200059,  # 柚
    200060,  # 泽克斯
    200061,  # 北原莉莉
    200062,  # 竹井久
    200063,  # 福路美穗子
    200064,  # 新子憧
    200065,  # 园城寺怜
    200066,  # 四宫冬实
    200067,  # 青鸾
    200068,  # 如月彩音
    200069,  # 未来
    200070,  # 鲁鲁修·兰佩洛基
    200071,  # C.C.
    200072,  # 枢木朱雀
    200073,  # 红月卡莲
    200074,  # 岚星
    200075,  # 凌
    200076,  # 东城玄音
    200077,  # 汉娜
    200078,  # 穆萨
    200079,  # 伊莉雅
    200080,  # 美游
    200081,  # 小黑
    200082,  # 吉尔
    200083,  # 伊芙·克里斯特
    200084,  # 琳琅
    200085,  # 袁枫
    200086,  # 砂狼白子
    200087,  # 小鸟游星野
    200088,  # 陆八魔爱露
    200089,  # 浅黄睦月
    200090,  # 玖辻
    200093,  # 莱娅
    200094,  # 辛西娅
    200095,  # 南枫花
]

# 使用非一般手模的角色的 id
special_charids = [
    200011,  # 四宫夏生
    200012,  # 汪次郎
    200013,  # 一之濑空
    200014,  # 明智英树
    200016,  # 莎拉
    200022,  # 约瑟夫
    200023,  # 斋藤治
    200025,  # 艾因
    200027,  # 月见山
    200028,  # 藤本绮罗
    200030,  # 如月莲
    200031,  # 石原碓海
    200039,  # 七夕
    200040,  # 蛇喰梦子
    200041,  # 早乙女芽亚里
    200043,  # 桃喰绮罗莉
    200045,  # A-37
    200047,  # 莱恩
    200049,  # 泷川夏彦
    200050,  # 赤木茂
    200051,  # 鹫巢岩
    200054,  # 夏弥尔
    200056,  # 白银御行
    200060,  # 泽克斯
    200070,  # 鲁鲁修·兰佩洛基
    200072,  # 枢木朱雀
    200075,  # 凌
    200077,  # 汉娜
    200078,  # 穆萨
    200081,  # 小黑
    200082,  # 吉尔
    200085,  # 袁枫
    200090,  # 玖辻
]

# 含有使用非一般手模的牌谱
paipu_uuids = [
    "210922-89412f45-9f47-44d8-a4d4-5756308049ad",  # 汪次郎的手 0
    "210926-5f5adaf3-0413-4489-95c2-98c212e521c3",  # 男性手 1
    "211120-3d914e69-8654-4235-9748-5398f983ff18",  # 男性手-深色 2
    "240423-2a2629fb-33c7-4034-ae42-29073bfb1da4",  # 手-深色 3
    "220131-8698c15e-8a1b-4a94-a5c9-06d0e83da6ec",  # 手-狂赌联动 4
    "211029-5b5b4162-c8d5-4677-b8af-cb78793df19c",  # 手-斗牌联动 5
    "231025-6ffaba43-7abe-46ea-80d1-90edbe5ea686",  # 手-汉娜 6
    "240814-8c6841b4-a706-446a-9e25-e07ce22867fb",  # 手-穆萨 7
]

# 使用非一般手模的角色的 id 与 牌谱之间的映射关系
dict_spchar_paipu = {
    200011: paipu_uuids[1],  # 四宫夏生
    200012: paipu_uuids[0],  # 汪次郎
    200013: paipu_uuids[1],  # 一之濑空
    200014: paipu_uuids[1],  # 明智英树
    200016: paipu_uuids[3],  # 莎拉
    200022: paipu_uuids[2],  # 约瑟夫
    200023: paipu_uuids[1],  # 斋藤治
    200025: paipu_uuids[1],  # 艾因
    200027: paipu_uuids[1],  # 月见山
    200028: paipu_uuids[3],  # 藤本绮罗
    200030: paipu_uuids[1],  # 如月莲
    200031: paipu_uuids[1],  # 石原碓海
    200039: paipu_uuids[1],  # 七夕
    200040: paipu_uuids[4],  # 蛇喰梦子
    200041: paipu_uuids[4],  # 早乙女芽亚里
    200043: paipu_uuids[4],  # 桃喰绮罗莉
    200045: paipu_uuids[2],  # A-37
    200047: paipu_uuids[1],  # 莱恩
    200049: paipu_uuids[1],  # 泷川夏彦
    200050: paipu_uuids[5],  # 赤木茂
    200051: paipu_uuids[5],  # 鹫巢岩
    200054: paipu_uuids[1],  # 夏弥尔
    200056: paipu_uuids[1],  # 白银御行
    200060: paipu_uuids[1],  # 泽克斯
    200070: paipu_uuids[1],  # 鲁鲁修·兰佩洛基
    200072: paipu_uuids[1],  # 枢木朱雀
    200075: paipu_uuids[1],  # 凌
    200077: paipu_uuids[6],  # 汉娜
    200078: paipu_uuids[7],  # 穆萨
    200081: paipu_uuids[3],  # 小黑
    200082: paipu_uuids[1],  # 吉尔
    200085: paipu_uuids[1],  # 袁枫
    200090: paipu_uuids[1],  # 玖辻
}

# 输出的文件名集合, 例子: 200001_一姬.js
outfile_names = []
for i in range(len(avatar_ids)):
    outfile_names.append(str(charids[i]) + "_" + nicknames[i][0] + ".js")

# 两个正则匹配串
pattern_name = r"editdata\.player_datas\[\d]\.nickname = \"(.*)\";"
pattern_id = r"editdata\.player_datas\[\d]\.avatar_id = (.*);"

# 作为模版的文件, 文件名是 template.js
infile = open("./template.js", "r")

# 更改角色使用手的脚本
change_hand = 'editdata.player_datas[0].views = editdata.player_datas[1].views = editdata.player_datas[2].views = editdata.player_datas[3].views = [{"slot": 3, "item_id": 309997}];'


# 直接进入回放的脚本, 可以在控制台输入
def Replay_Script(uuid):
    return "GameMgr.Inst.checkPaiPu(\"" + uuid + "\", 0)"

# 立直棒, slot: 0
liqibangs = [
    305001,  # 咸鱼立直棒
    305002,  # 大葱立直棒
    305003,  # 狗骨头立直棒
    305004,  # 巧克力立直棒
    305005,  # 邪眼立直棒
    305006,  # 翡翠立直棒
    305010,  # 立直-苍火
    305018,  # 猩红立直棒
    305019,  # 24K金棒
    305027,  # 立直棒-爆竹
    305028,  # 立直棒-饺子
    305041,  # 立直棒-断恶
    305042,  # 立直棒-雪糕
    305049,  # 立直棒-炎夏型一姬甜筒
    305600,  # 立直棒-小恶魔蝙蝠
    305601,  # 立直棒-魔法棒
    305602,  # 立直棒-金龙鱼
    305603,  # 立直棒-绯月荆棘
    305604,  # 立直棒-乘风破浪
    305605,  # 立直棒-应援棒
    305606,  # 立直棒-冰糖葫芦(咸)
    305607,  # 立直棒-仿生喵
    305608,  # 立直棒-夹心猫团子
    305609,  # 立直棒-虚无传送门
    305610,  # 立直棒-喵切丸
    305611,  # 立直棒-如意
    305612,  # 立直棒-陨石法杖
    305613,  # 立直棒-波子汽水
    305614,  # 立直棒-仙境密匙
    305615,  # 立直棒-柴犬团子
    305616,  # 立直棒-魔法扫帚
    305617,  # 立直棒-王者风范
    305618,  # 立直棒-猫神剑玉
    305619,  # 立直棒-可口喵乐
    305620,  # 立直棒-秘传之卷
    305621,  # 立直棒-盆栽
    305622,  # 立直棒-包甜好瓜
    305623,  # 立直棒-法棍面包
    305624,  # 立直棒-学霸眼镜
    305625,  # 立直棒-棒球英杰
    305626,  # 立直棒-霓彩路标
    308003,  # 立直棒-墨西哥卷饼
    308008,  # 立直棒-生死之剑
    308013,  # 立直棒-命悬一线
    308018,  # 立直棒-恋之反省
    308023,  # 立直棒-爱心便当
    308028,  # 立直棒-骑士的钥匙
    308033,  # 立直棒-红晖的魔杖
    308038,  # 立直棒-大蛇比纳
    30560001,  # 立直棒-喵星棒
    30560002,  # 立直棒-夺笋
    30560003,  # 立直棒-小鳄霸
]

# 和牌特效, slot: 1
hupais = [
    305007,  # 和牌-烈焰
    305008,  # 和牌-旋风
    305009,  # 和牌-樱花
    305023,  # 和牌-黑炎
    305029,  # 和牌-烟花
    305034,  # 和牌-爆炎龙卷
    305035,  # 和牌-方舟反应堆
    305036,  # 和牌-红玫瑰
    305039,  # 和牌-K.O.
    305040,  # 和牌-逆鳞
    305200,  # 和牌-幽灵嗷嗷
    305201,  # 和牌-歌剧魅影
    305202,  # 和牌-魔法少女
    305203,  # 和牌-阖家欢
    305204,  # 和牌-群星之寂
    305205,  # 和牌-厄里斯之瞳
    305206,  # 和牌-天降正义
    305207,  # 和牌-黄金之蝶
    305208,  # 和牌-海浪的馈赠
    305209,  # 和牌-安可
    305210,  # 和牌-鸿运开年
    305211,  # 和牌-核心裂变
    305212,  # 和牌-无间契印
    305213,  # 和牌-疾月斩
    305215,  # 和牌-剑吟虎啸
    305216,  # 和牌-槲寄生下
    305217,  # 和牌-金屏春色
    305218,  # 和牌-天罚
    305219,  # 和牌-银链飞雪
    305220,  # 和牌-泰山鸭顶
    305221,  # 和牌-机械哲学
    305222,  # 和牌-天地无用
    305223,  # 和牌-衔环结草
    305224,  # 和牌-黑洞
    305225,  # 和牌-收割时刻
    305226,  # 和牌-水之道
    308001,  # 和牌-龙卷雷霆
    308006,  # 和牌-命运之轮
    308011,  # 和牌-地狱低语
    308016,  # 和牌-恋之降临
    308021,  # 和牌-高岭之花
    308026,  # 和牌-绝对的命令
    308031,  # 和牌-魔力的迸发
    308036,  # 和牌-冷血射击
    30520001,  # 和牌-杰克的恶作剧
    30520002,  # 和牌-虚空结界
    30520003,  # 和牌-墨韵
    30520004,  # 和牌-伺机而动
    30520005,  # 和牌-喵——呜！
    30520006,  # 和牌-落羽涅槃
]

# 立直特效, slot: 2
liqis = [
    305021,  # 立直-碎冰
    305022,  # 立直-火焰
    305032,  # 立直-幻影
    305033,  # 立直-飞羽
    305037,  # 立直-叮～
    305038,  # 立直-龙腾
    305300,  # 立直-蝙蝠桀桀
    305301,  # 立直-非常事态
    305302,  # 立直-魔法少女
    305303,  # 立直-鼠生威
    305304,  # 立直-星陨
    305305,  # 立直-血·朗基努斯枪
    305306,  # 立直-断罪
    305307,  # 立直-蝶惑
    305308,  # 立直-浪之声
    305309,  # 立直-开场曲
    305310,  # 立直-生财有道
    305311,  # 立直-虚拟导航
    305312,  # 立直-灵魂契约
    305313,  # 立直-风华斩
    305315,  # 立直-虎啸长风
    305316,  # 立直-鹿雪冬至
    305317,  # 立直-暗香梅影
    305318,  # 立直-雷电环索
    305319,  # 立直-蛇行诡道
    305320,  # 立直-立直鸭
    305321,  # 立直-量子智能
    305322,  # 立直-毒烟玉
    305323,  # 立直-狐缘之绊
    305324,  # 立直-猫过留痕
    305325,  # 立直-问心之镰
    305326,  # 立直-滚雪球效应
    308002,  # 立直-花天月地
    308007,  # 立直-纸牌花火
    308012,  # 立直-幽冥之焰
    308017,  # 立直-恋之箭矢
    308022,  # 立直-未来视
    308027,  # 立直-王者的决意
    308032,  # 立直-英灵的典仪
    308037,  # 立直-虹色轨迹
    30530001,  # 立直-南瓜夜行
    30530002,  # 立直-星河入梦
    30530003,  # 立直-挥毫
    30530004,  # 立直-一步之遥
    30530005,  # 立直-萌爪狂欢
    30530006,  # 立直-有凤来仪
]

# 手的样式, slot: 3
hands = [
    305011,  # 橘猫爪
    305030,  # 夜月猫爪
    305031,  # 蓝猫爪
    309500,  # 橘色虎爪
    309991,  # 手-汉娜(已过期) 穆萨
    309992,  # 手-汉娜(已过期) 汉娜
    309993,  # 手-斗牌联动(已过期)
    309994,  # 手-狂赌联动(已过期) 除了生志摩妄
    309995,  # 手-深色(已过期) 藤本绮罗, 莎拉, 小黑
    309996,  # 男性手-深色(已过期) 约瑟夫, A-37
    309997,  # 手-默认(已过期)
    309998,  # 男性手(已过期)
    309999,  # 汪次郎的手(已过期)
]

# 头像框, slot: 5
avatar_frames = [
    305500,  # 头像框-豆芽
    305501,  # 头像框-默认
    305510,  # 头像框-四象战
    305511,  # 头像框-四象战
    305512,  # 头像框-四象战
    305513,  # 头像框-四象战
    305514,  # 头像框-四象战
    305515,  # 头像框-四象战
    305516,  # 头像框-四象战
    305517,  # 头像框-四象战
    305518,  # 头像框-四象战
    305519,  # 头像框-四象战
    305520,  # 头像框-试炼强者
    305521,  # 头像框-试炼贤者
    305522,  # 头像框-试炼霸者
    305523,  # 头像框-猫咪军团的身份
    305524,  # 头像框-四象战
    305525,  # 双聖の眷属たち
    305526,  # Team Championship Limited <br>Portrait Frame
    305527,  # 头像框-四象战
    305528,  # 头像框-四象战
    305529,  # 头像框-秋霜切玉
    305530,  # 头像框-四象战
    305531,  # 头像框-四象战
    305532,  # 头像框-四象战
    305533,  # 双聖の眷属たち
    305534,  # 头像框-四象战
    305535,  # 头像框-四象战
    305536,  # 头像框-四象战
    305537,  # 头像框-圣堂百合
    305538,  # 头像框-四象战
    305539,  # 双聖の眷属たち
    305540,  # 头像框-四象战
    305541,  # 头像框-四象战
    305542,  # 头像框-雪夜童话
    305543,  # 头像框-四象战
    305544,  # 头像框-四象战
    305545,  # 头像框-窗外
    305546,  # 双聖の眷属たち
    305547,  # 头像框-四象战
    305548,  # 头像框-四象战
    305549,  # 头像框-四象战
    305550,  # 头像框-四象战
    305551,  # 头像框-丹心一寸
    305552,  # 头像框-大小姐发带
    305553,  # 双聖の眷属たち
    305555,  # 头像框-豆芽测试用
    30550001,  # 头像框-四象战
    30550002,  # 头像框-四象战
    30550003,  # 头像框-四象战
    30550004,  # 头像框-四象战
    30550005,  # 头像框-四象战
    30550006,  # 头像框-四象战
    30550007,  # 双聖の眷属たち
    30550008,  # 头像框-四象战
    30550009,  # 头像框-四象战
    30550010,  # 头像框-四象战
    30550011,  # 头像框-四象战
    30550012,  # 头像框-赤丹霞羽
]

# 称号
titles = [
    600001,  # 无称号
    600002,  # 原初之火
    600003,  # 萤火之光
    600004,  # 最初的雀圣 四麻
    600005,  # 魂之契约者 初阶
    600006,  # 魂之契约者 中阶
    600007,  # 魂之契约者 高阶
    600008,  # 魂之启迪者 初阶
    600009,  # 魂之启迪者 中阶
    600010,  # 魂之启迪者 高阶
    600011,  # 魂之缔造者 初阶
    600012,  # 魂之缔造者 中阶
    600013,  # 魂之缔造者 高阶
    600014,  # 魂之超越者
    600015,  # 猫粮供应商
    600016,  # 最初的魂天 四麻
    600017,  # 认证玩家
    600018,  # 12Dora
    600019,  # 杆菌无敌
    600020,  # 佐仓沙耶加
    600021,  # 喵国大护法
    600022,  # 最初的雀圣 三麻
    600023,  # 最初的魂天 三麻
    600024,  # 2434初代優勝
    600025,  # 限时称号测试用
    600026,  # 雀魂公認の選ばれしプレイヤーG
    600027,  # 万象更新
    600028,  # 试炼之道S1纪念
    600029,  # インターハイ王者
    600031,  # 成长之旅
    600032,  # 连胜之道
    600033,  # 星罗云布
    600034,  # 天选之证
    600035,  # 千锤百炼
    600036,  # 牌桌见闻
    600037,  # 良好市民
    600038,  # 神社贵宾
    600039,  # 森罗万象
    600040,  # 千客万来
    600041,  # 最強鴉天狗の愛弟子
    600042,  # 麒麟位2021
    600043,  # Limited Title
    600044,  # 花より団子
    600045,  # 一姬当千
    600046,  # 逍遥散人
    600047,  # 火龙果说电影
    600048,  # 伝説の名コンビ
    600049,  # 伝説の迷コンビ
    600050,  # 麒麟位2021
    600051,  # 虹懸かる右手
    600052,  # 斗鱼雀神杯冠军
    600053,  # 麒麟位2022
    600054,  # 天元北斗
    600055,  # 麻雀スクワッド
    600056,  # B.league S1冠军
    600064,  # 天元北斗
    600065,  # 斗鱼雀神杯冠军
    600066,  # みんな家族
    600067,  # ぶいすぽ女傑
    600068,  # 火龙果杯总冠军
    600069,  # インターハイ王者
    600070,  # 麒麟位2022
    600071,  # 煌めく女王の星
    600072,  # 闘魂杯王者
    600073,  # 華風戦優勝
    600074,  # 麒麟位2023
    600075,  # RMLS1总冠军
    600076,  # 雀魂インビ夏王者
    600077,  # 雀魂インビ冬将軍
    600078,  # 喵之一手
    600079,  # 斗鱼雀神杯冠军
    600080,  # 火龙果杯总冠军
    600081,  # 野鳥観察部
    600082,  # ななしサンマ王
    600083,  # 斗鱼雀神杯个人赛冠军
    600084,  # 斗鱼鬼神杯S3
    600085,  # ぶいすぽの頂
    600086,  # 麒麟位2023
    600087,  # 雀荘牌舞台
    600088,  # 闘魂杯王者
    600089,  # 麒麟位2024
    600090,  # 四象战冠军
    600091,  # 四象战冠军
    600092,  # 四象战冠军
    600093,  # 花ノ国 戦国最強
    600094,  # 青云之志
    600095,  # 双聖戦優勝
    600096,  # 820邹倚天
    600097,  # 雀魂インビ夏王者
]
